#include <stdio.h>

int main() {

    int A = -2 + 5 * 2;  //กำหนดตัวแปร A
    printf("A = -2 + 5 * 2\n");  //แสดงค่าโจทย์ ข้อ A
    printf(" วิธีคิด : -2 + 5 * 2 = -2 + 10 = %d\n",A); //แสดงค่าวิธีการคิด
    printf(" คำตอบ A : %d\n\n",A);  //แสดงค่าคำตอบ

    int B = 10 / 2 * 3; //กำหนดตัวแปร B
    printf("B = 10 / 2 * 3\n");  //แสดงค่าโจทย์ ข้อ B
    printf(" วิธีคิด : 10 / 2 * 3 = 5 * 3 = %d\n",B); //แสดงค่าวิธีการคิด
    printf(" คำตอบ B : %d\n\n",B);  //แสดงค่าคำตอบ

    int C = 6 / 2 + 3 * (4 % 2); //กำหนดตัวแปร C
    printf("C = 6 / 2 + 3 * (4 mod 2)\n"); //แสดงค่าโจทย์ ข้อ C
    printf(" วิธีคิด : 6 / 2 + 3 (4 mod 2) = 3 + 0 = %d\n",C); //แสดงค่าวิธีการคิด
    printf(" คำตอบ C : %d\n\n",C);  //แสดงค่าคำตอบ

    int D = (5 + 2) * 15 % 4;  //กำหนดตัวแปร D
    printf("D = (5 + 2) * 15 %% 4\n");  //แสดงค่าโจทย์ ข้อ D
    printf(" วิธีคิด : (5 + 2) * 15 mod 4 = 7 * 15 %% 4 = 105 %% 4 = %d\n",D); //แสดงค่าวิธีการคิด
    printf(" คำตอบ D : %d\n\n",D);  //แสดงค่าคำตอบ

    int E = 6 + 2 * 2 - 6 / 2; //กำหนดตัวแปร E
    printf("E = 6 + 2 * 2 - 6 / 2\n");  //แสดงค่าโจทย์ ข้อ E
    printf(" วิธีคิด : 6 + (2 * 2) - (6 / 2) =  6 + 4 - 3 = 10 - 3 = %d\n",E); //แสดงค่าวิธีการคิด
    printf(" คำตอบ : %d\n\n",E);  //แสดงค่าคำตอบ

    int F = 5 + 3 * 2 - 8 / 4 + (6 % 5); //กำหนดตัวแปร F
    printf("F = 5 + 3 * 2 - 8 / 4 + (6 %% 5)\n"); //แสดงค่าโจทย์ ข้อ F
    printf(" วิธีคิด : 5 + 3 * 2 - 8 / 4 + (6 %% 5) = 5 + 6 - 2 + (6 %% 5) = 9 + 1 = %d\n",F); //แสดงค่าวิธีการคิด
    printf(" คำตอบ : %d\n\n",F);  //แสดงค่าคำตอบ
    
    int G = (4 + 3) * 2 - 10 / (2 + 3); //กำหนดตัวแปร G
    printf("G = (4 + 3) * 2 - 10 / (2 + 3)\n"); //แสดงค่าโจทย์ ข้อ G
    printf(" วิธีคิด : (4 + 3) * 2 - 10 / (2 + 3) = 7 * 2 - 2 = %d\n",G); //แสดงค่าวิธีการคิด
    printf(" คำตอบ : %d\n\n",G); //แสดงค่าคำตอบ

    return 0;

}