#include <stdio.h>

int main() {
    int x = 12, y = 7, z = 12;  //กำหนดค่าตัวแปร x y z

    if (x>y)                                        // สร้างเงื่อนไข ถ้าหาก x>y ให้แสดงผลเป็น 1 ถ้าไม่ตรงเงื่อนไขให้แสดง 0 
        printf("x>y : 1\n");
    else
        printf("x>y : 0\n");  

    printf("--------------------------------\n");

    if (x<z)                                        // สร้างเงื่อนไข ถ้าหาก x<z ให้แสดงผลเป็น 1 ถ้าไม่ตรงเงื่อนไขให้แสดง 0
        printf("x<z : 1\n");
    else
        printf("x<z : 0\n");

    printf("--------------------------------\n");
    

    if (x==z)                                       // สร้างเงื่อนไข ถ้าหาก x==z ให้แสดงผลเป็น 1 ถ้าไม่ตรงเงื่อนไขให้แสดง 0
        printf("x==z : 1\n");
    else
        printf("x==z : 0\n");

    printf("--------------------------------\n");

    if (x!=y)                                       // สร้างเงื่อนไข ถ้าหาก x!=y ให้แสดงผลเป็น 1 ถ้าไม่ตรงเงื่อนไขให้แสดง 0
        printf("x!=y : 1\n");
    else
        printf("x!=y : 0\n");

    printf("--------------------------------\n");

    if (!(2*5>=y)||(5!=(5/3)))                      // สร้างเงื่อนไข ถ้าหาก !(2*5>=y)||(5!=(5/3)) ให้แสดงผลเป็น 1 ถ้าไม่ตรงเงื่อนไขให้แสดง 0
        printf("!(2*5>=y)||(5!=(5/3)) : 1\n");
    else
        printf("!(2*5>=y)||(5!=(5/3)) : 0\n");

    printf("--------------------------------\n");

    if (!(x<y))                                     // สร้างเงื่อนไข ถ้าหาก !(x<y) ให้แสดงผลเป็น 1 ถ้าไม่ตรงเงื่อนไขให้แสดง 0
        printf("!(x<y) : 1\n");
    else
        printf("!(x<y) : 0\n");

    printf("--------------------------------\n");

     if ((x+y)>(z*2))                                // สร้างเงื่อนไข ถ้าหาก (x+y)>(z*2) ให้แสดงผลเป็น 1 ถ้าไม่ตรงเงื่อนไขให้แสดง 0
        printf("(x+y)>(z*2) : 1\n");
    else
        printf("(x+y)>(z*2) : 0\n");

    printf("--------------------------------\n");

    if ((x%2==0)||(y%2==1))                         // สร้างเงื่อนไข ถ้าหาก (x%2==0)||(y%2==1) ให้แสดงผลเป็น 1 ถ้าไม่ตรงเงื่อนไขให้แสดง 0
        printf("(x mod 2==0)||(y mod 2==1) : 1\n");
    else
        printf("(x mod 2==0)||(y mod 2==1) : 0\n");

    printf("--------------------------------\n");
        
    if ((x>y)&&(z<y))                               // สร้างเงื่อนไข ถ้าหาก (x>y)&&(z<y) ให้แสดงผลเป็น 1 ถ้าไม่ตรงเงื่อนไขให้แสดง 0
        printf("(x>y)&&(z<y) : 1\n");
    else
        printf("(x>y)&&(z<y) : 0\n");

    printf("--------------------------------\n");

return 0; //จบการทำงาน
}