#include <stdio.h> 

int main() {   
    int a = 5; //กำหนดตัวแปร a พร้อมใส่ค่า
    int b = 17;  //กำหนดตัวแปร b พร้อมใส่ค่า
    float c = 8.5; //กำหนดตัวแปร c พร้อมใส่ค่า
    float d = 4.0; //กำหนดตัวแปร d พร้อมใส่ค่า

    printf("บรรทัดที่ 1\n a=%d\n b=%d\n c=%.1f\n d=%.1f\n", a, b, c, d); //ทำให้เป็นค่าเริ่มต้น ใช้ %d กับ %f เพื่อให้แต่ละตัวเป็นจำนวนเต็มกับทศนิยม ตามค่าเริ่มต้น

    int result1; //กำหนดตัวแปร result1
    result1 = d+a; //กำหนดให้ค่า result1 เท่ากับ d*a
    printf("บรรทัดที่ 2 = %d\n",result1); //แสดงผล บรรทัดสอง เท่ากับ ใช้ค่าจาก result1  จะได้เป็น 4.0+5 แสดงผลเป็นจำนวนเต็มโดยใช้ %d
    
    int result2; //กำหนดตัวแปร result2
    result2 = a-b; //กำหนดให้ค่า result2 เท่ากับ a-b
    printf("บรรทัดที่ 3 = %d\n",result2); //แสดงผล บรรทัดสาม เท่ากับ ใช้ค่าจาก result2 จะได้เป็น 5-17 แสดงผลเป็นจำนวนเต็มโดยใช้ %d

    float result3; //กำหนดตัวแปร result3
    result3 = c*d; //กำหนดให้ค่า result3 เท่ากับ c*d
    printf("บรรทัดที่ 4 = %.2f\n",result3); //แสดงผล บรรทัดสี่ เท่ากับ ใช้ค่าจาก result3 จะได้เป็น 8.5x4.0 แสดงผลเป็นทศนิยมสองตำแหน่งโดยใช้ %.2f

    float result4; //กำหนดตัวแปร result4
    result4 = a*c; //กำหนดให้ค่า result4 เท่ากับ a*c
    printf("บรรทัดที่ 5 = %.2f\n",result4); //แสดงผล บรรทัดห้า เท่ากับ ใช้ค่าจาก result4 จะได้เป็น 5x8.5 แสดงผลเป็นทศนิยมสองตำแหน่งโดยใช้ %.2f

    float result5; //กำหนดตัวแปร result5
    result5 = c/d; //กำหนดให้ค่า result5 เท่ากับ c/d
    printf("บรรทัดที่ 6 = %.2f\n",result5); //แสดงผล บรรทัดหก เท่ากับ ใช้ค่าจาก result5 จะได้เป็น 8.5หาร4.0 แสดงผลเป็นทศนิยมสองตำแหน่งโดยใช้ %.2f

    float result6; //กำหนดตัวแปร result6
    result6 = b/c; //กำหนดให้ค่า result6 เท่ากับ b/c
    printf("บรรทัดที่ 7 = %.2f\n",result6); //แสดงผล บรรทัดเจ็ด เท่ากับ ใช้ค่าจาก result6 จะได้เป็น 17หารเอาเศษ8.5 แสดงผลเป็นทศนิยมสองตำแหน่งโดยใช้ %.2f

    int result7;  //กำหนดตัวแปร result7
    result7 = a%b; //กำหนดให้ค่า result7 เท่ากับ a%b
    printf("บรรทัดที่ 8 = %d\n",result7); //แสดงผล บรรทัดแปด เท่ากับ ใช้ค่าจาก result7 จะได้เป็น 5หารเอาเศษ17 แสดงผลเป็นจำนวนเต็มโดยใช้ %d

    printf("บรรทัดที่ 9 ไม่สามารถ run ได้เพราะว่า c เป็น float แต่ a เป็น int และ การหารเอาเศษ ไม่ได้สามารถดำเนินการกับทศนิยมได้\n"); //แสดงค่าอธิบายบรรทัดที่เก้า

    printf("บรรทัดที่ 10 ไม่สามารถ run ได้เพราะการหารเอาเศษไม่สามารถใช้กับทศนิยมได้"); //แสดงค่าอธิบายบรรทัดที่สิบ

    return 0; //จบการทำงาน
}