#include <stdio.h>

int main(){
    int a = 5; //กำหนดค่าตัวแปร a
    int b = 2; //กำหนดค่าตัวแปร b
    float x = 3.0; //กำหนดค่าตัวแปร x
    float y = 4.5; //กำหนดค่าตัวแปร y

    int r1; //กำหนดค่าตัวแปร r1
    int r2;  //กำหนดค่าตัวแปร r2
    float r3;  //กำหนดค่าตัวแปร r3
    float r4;  //กำหนดค่าตัวแปร r4

    r1 = a++ * b + (int)y % 3;  //คำนวณค่า r1
    printf(" r1 : 5 * 2 + 1 = 10 + 1 = %d\n",r1); //แสดงค่าวิธีคิด
    printf(" คำตอบ : %d\n\n",r1); //แสดงค่าคำตอบ

    r2 = (a > b) &&((int)x / b < 2); //คำนวณค่า r2
    printf("r2 : (a > b ) = (6 > 2) = true\n(int)x = 3 , b = 2 3/2 = 1 \n (1 < 2) = true \n true && true = %d\n",r2); //แสดงค่าวิธีคิด
    printf(" คำตอบ : %d\n\n",r2); //แสดงค่าคำตอบ

    
    r3 = ++x * y - a / 2; //คำนวณค่า r3
    printf("r3 : 4.0 * 4.5 = 18.0 \na = 6 / 2 = 3\n 18 - 3 = %.2f\n",r3); //แสดงค่าวิธีคิด
    printf(" คำตอบ : %.1f\n\n",r3); //แสดงค่าคำตอบ
 
    
    r4 = ((x + 1.5) > y) || (b-- > 0); //คำนวณค่า r4
    printf("r4 : x = 4.0 + 1.5 = 5.5 > y = true\n 2 > 0 = true\ntrue || true = %.1f\n ",r4); //แสดงค่าวิธีคิด
    printf("คำตอบ : 1.0\n"); //แสดงค่าคำตอบ


    return 0;
}